tests/expected/production-cycles/diagram.mermaid
flowchart LR
    n0["src"]
    n1["src/export"]
    n2["src/graph"]
    n3["tests"]
    n4["tools"]
    n0 -->|20| n0
    linkStyle 0 stroke:#E41A1C,color:#E41A1C,stroke-width:3.0px
    n0 -->|2| n1
    n0 -->|8| n2
    n1 -->|18| n1
    linkStyle 3 stroke:#377EB8,color:#377EB8,stroke-width:3.0px
    n1 -->|13| n2
    n2 -->|5| n2
    linkStyle 5 stroke:#4DAF4A,color:#4DAF4A,stroke-width:3.0px
    n4 -->|3| n0
